#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьАктыНаСервере(Данные) Экспорт
	Сообщение = "";
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Для каждого Ссылка из Данные.МассивСсылок Цикл
			Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				ДокОбъект.Договор = Ссылка.Ссылка;
				ДокОбъект.Дата = ТекущаяДатаСеанса();
				ДокОбъект.Организация = Ссылка.Организация;
				ДокОбъект.Контрагент = Ссылка.Владелец;
				ДокОбъект.Ответственный = Пользователи.ТекущийПользователь();
				ДокОбъект.ВыполнитьАвтозаполнение(Ложь);
				ДокОбъект.ПроверитьЗаполнение();
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДокОбъект = Ссылка.ПолучитьОбъект();
				ДокОбъект.ВыполнитьАвтозаполнение(Ложь);
				ДокОбъект.ПроверитьЗаполнение();
				ДокОбъект.Записать();
				
				Сообщение = "Изменен(ы) документ(ы) реализации.";
			Иначе
				Сообщение = "Ошибка, объекты не найдены";
			КонецЕсли;
		КонецЦикла;
	Иначе
		Сообщение = "Ошибка, неудалось создать документы";
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

#КонецЕсли