#Область СлужебныеПроцедурыИФункции

Процедура BKM_ОтправитьУведомления() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	ДанныеЗапроса = "bot" + Константы.BKM_ТГТокен.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеЗапроса);
	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json");
	ИдентификаторГруппы = Константы.BKM_ТГИдентификатор.Получить();
	ДанныеКОтправке = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_УведомлениеТГ.Ссылка КАК Ссылка,
		|	BKM_УведомлениеТГ.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.BKM_УведомлениеТГ КАК BKM_УведомлениеТГ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппы);
		Сообщение.Вставить("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		ДанныеКОтправке.Добавить(Сообщение);
	
		ТелоОтвета = ЗаписатьЗначениеJSON(Сообщение);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоОтвета);
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
		Если HTTPОтвет.КодСостояния = 200 Тогда
			СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("HTTPСервис.Ошибка",УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти