#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = "";
	Если ЭтоНовый() Тогда
		Сообщение = СтрШаблон("Создан новый документ ОбслуживаниеКлиента. Назначенный специалист: %1",Специалист);
		НоваяЗапись = Справочники.BKM_УведомлениеТГ.СоздатьЭлемент();
		НоваяЗапись.ТекстСообщения = Сообщение;
		НоваяЗапись.Записать();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда

		Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
			Сообщение = СтрШаблон("дата проведения работ. Было: %1, Стало: %2", 
							Выборка.ДатаПроведенияРабот, ДатаПроведенияРабот);
		КонецЕсли;
		
		Если Выборка.Специалист <> Специалист Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("специалист. Было: %1, Стало: %2",
							Выборка.Специалист, Специалист);
		КонецЕсли;
		
		Если Выборка.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("время окончания работ. Было: %1, Стало: %2",
							Выборка.ВремяОкончанияРабот, ВремяОкончанияРабот);
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("время начала работ. Было: %1, Стало: %2",
							Выборка.ВремяНачалаРабот, ВремяНачалаРабот);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сообщение) Тогда	
			СообщениеИзм = СтрШаблон("В ""%1"" были изменены: %2", Ссылка, Сообщение);
			СообщениеИзм = СообщениеИзм + ".";
			НоваяЗапись = Справочники.BKM_УведомлениеТГ.СоздатьЭлемент();
			НоваяЗапись.ТекстСообщения = СообщениеИзм;
			НоваяЗапись.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало КАК ВКМ_ПериодДействияНачало,
		|	ДоговорыКонтрагентов.BKM_ПериодДействияКонец КАК BKM_ПериодДействияКонец,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.(
		|		ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту) КАК ВыполненныеРаботы,
		|	ЕСТЬNULL(BKM_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.BKM_УсловияОплатыСотрудников.СрезПоследних(&Дата, МЕСЯЦ(Период) = МЕСЯЦ(&Дата)) КАК
		|			BKM_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &СсылкаДоговор
		|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &СсылкаДок";
	
	Запрос.УстановитьПараметр("СсылкаДоговор", Договор);
	Запрос.УстановитьПараметр("СсылкаДок", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание и
		 ВыборкаДетальныеЗаписи.Дата < ВыборкаДетальныеЗаписи.BKM_ПериодДействияКонец и 
		 ВыборкаДетальныеЗаписи.Дата > ВыборкаДетальныеЗаписи.ВКМ_ПериодДействияНачало Тогда
		 	
			Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
			ВыборкаРаботы = ВыборкаДетальныеЗаписи.ВыполненныеРаботы.Выбрать();
			
			Пока ВыборкаРаботы.Следующий() Цикл
				Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
				Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
				Движение.КоличествоЧасов = ВыборкаРаботы.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаРаботы.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
			КонецЦикла;
			
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
			Сообщение = СтрШаблон("Ошибка, специалисту %1 на дату %2 не установлен процент от работ",
								ВыборкаДетальныеЗаписи.Специалист, Формат(Дата,"ДФ=dd.MM.yyyy;"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Отказ = Истина;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ПроцентОтРабот > 0 Тогда
			Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
			ВыборкаРаботы = ВыборкаДетальныеЗаписи.ВыполненныеРаботы.Выбрать();
			
			Пока ВыборкаРаботы.Следующий() Цикл
				Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Специалист;
				Движение.ЧасовКОплате = ВыборкаРаботы.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаРаботы.ЧасыКОплатеКлиенту *  ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы *
									ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;					 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 





