
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьАкты(Команда)
	ДлительнаяОперация = ВыполнитьДлительнуюОперацию();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(Команда)
	ЗаполнитьДоговорыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьДлительнуюОперацию()
	ДанныеСсылок = Новый Структура;
	ДанныеСсылок.Вставить("МассивСсылок", Новый Массив);
	ДанныеТЧ = Объект.ТаблицаСсылок;
	
	Для каждого СтрокаТЧ из ДанныеТЧ Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Реализация) Тогда
			ДанныеСсылок.МассивСсылок.Добавить(СтрокаТЧ.Реализация.Ссылка);
		Иначе
			ДанныеСсылок.МассивСсылок.Добавить(СтрокаТЧ.Договор.Ссылка);
		КонецЕсли;
	КонецЦикла;
					
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
				"Обработки.BKM_МассовоеСозданиеРеализаций.ЗаполнитьАктыНаСервере", ДанныеСсылок);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда
		Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		ЗаполнитьДоговорыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И МЕСЯЦ(ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало) = МЕСЯЦ(&ПериодДействияНачалоМесяц)
		|	И ГОД(ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало) = ГОД(&ПериодДействияНачалоГод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
		|	ВТ_Договор.Ссылка КАК ДоговорСсылка
		|ИЗ
		|	ВТ_Договор КАК ВТ_Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслуг.Договор = ВТ_Договор.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ПериодДействияНачалоМесяц", Объект.Период);
	Запрос.УстановитьПараметр("ПериодДействияНачалоГод", Объект.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.ТаблицаСсылок.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеТЧ = Объект.ТаблицаСсылок.Добавить();
		ДанныеТЧ.Договор = ВыборкаДетальныеЗаписи.ДоговорСсылка;
		ДанныеТЧ.Реализация = ВыборкаДетальныеЗаписи.РеализацияСсылка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
