#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = Параметры.АдресВХранилище;
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Для каждого Строка из ОтпускаСотрудников Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Текст = Строка.Сотрудник;
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
		CтрокаТаблицы = Объект.ОтпускаСотрудников.Добавить();
		CтрокаТаблицы.Сотрудник = Строка.Сотрудник;
		CтрокаТаблицы.ДатаНачала = Строка.ДатаНачала;
		CтрокаТаблицы.ДатаОкончания = Строка.ДатаОкончания;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
