// BKM_Чертыковцев
#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ВыполнитьПроверкуНасервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыполнитьПроверкуНасервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВыполнитьПроверкуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПроверкуНасервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_ПериодДействияНачало.Доступность = Истина;
		Элементы.BKM_ПериодДействияКонец.Доступность = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Истина;
	Иначе
		Элементы.ВКМ_ПериодДействияНачало.Доступность = Ложь;
		Элементы.BKM_ПериодДействияКонец.Доступность = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
// BKM_Чертыковцев