#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.BKM_ГрафикОтпусков.ОтпускаСотрудников КАК BKM_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.BKM_ОтпускаСотрудников.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.BKM_ОтпускаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Год = Год;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Количество = (Выборка.ДатаОкончания - Выборка.ДатаНачала) / 86400;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли