#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	СформироватьДвиженияОсновныеНачиления();
	РасчитатьОклад();
	РасчитатьОтпуск();
	СформироватьДвиженияУдержания();
	РасчитатьУдержания();
	СформироватьДвиженияВзаиморасчеты();
КонецПроцедуры

Процедура СформироватьДвиженияОсновныеНачиления()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_НачисленияЗарплатыОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	НАЧАЛОПЕРИОДА(BKM_НачисленияЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания КАК ДатаОкончания,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы
		|ПОМЕСТИТЬ ВТ_Оклад
		|ИЗ
		|	Документ.BKM_НачисленияЗарплаты.ОсновныеНачисления КАК BKM_НачисленияЗарплатыОсновныеНачисления
		|ГДЕ
		|	BKM_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И BKM_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаОклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(BKM_УсловияОплатыСотрудников.Период) КАК Период,
		|	ВТ_Оклад.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ТекПериодыОкладов
		|ИЗ
		|	ВТ_Оклад КАК ВТ_Оклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.BKM_УсловияОплатыСотрудников КАК BKM_УсловияОплатыСотрудников
		|		ПО ВТ_Оклад.Сотрудник = BKM_УсловияОплатыСотрудников.Сотрудник
		|		И ВТ_Оклад.ПериодДействия >= BKM_УсловияОплатыСотрудников.Период
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Оклад.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оклад.Сотрудник КАК Сотрудник,
		|	ВТ_Оклад.ВидРасчета КАК ВидРасчета,
		|	ВТ_Оклад.ПериодДействия КАК ПериодДействияНачало,
		|	ВТ_Оклад.ДатаОкончания КАК ПериодДействияКонец,
		|	ВТ_Оклад.ГрафикРаботы КАК ГрафикРаботы,
		|	BKM_УсловияОплатыСотрудников.Оклад КАК Показатель,
		|	ДОБАВИТЬКДАТЕ(ВТ_Оклад.ПериодДействия, МЕСЯЦ, -13) КАК БазовыйПериодНачало,
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ_Оклад.ДатаОкончания, МЕСЯЦ), МЕСЯЦ, -1) КАК БазовыйПериодКонец
		|ИЗ
		|	ВТ_Оклад КАК ВТ_Оклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекПериодыОкладов КАК ВТ_ТекПериодыОкладов
		|		ПО ВТ_Оклад.НомерСтроки = ВТ_ТекПериодыОкладов.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.BKM_УсловияОплатыСотрудников КАК BKM_УсловияОплатыСотрудников
		|		ПО ВТ_Оклад.Сотрудник = BKM_УсловияОплатыСотрудников.Сотрудник
		|		И ВТ_ТекПериодыОкладов.Период = BKM_УсловияОплатыСотрудников.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	BKM_НачисленияЗарплатыОсновныеНачисления.Сотрудник,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ВидРасчета,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ДатаНачала,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания,
		|	BKM_НачисленияЗарплатыОсновныеНачисления.ГрафикРаботы,
		|	NULL,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(BKM_НачисленияЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ), МЕСЯЦ, -13),
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(BKM_НачисленияЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ), МЕСЯЦ, -1)
		|ИЗ
		|	Документ.BKM_НачисленияЗарплаты.ОсновныеНачисления КАК BKM_НачисленияЗарплатыОсновныеНачисления
		|ГДЕ
		|	BKM_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И BKM_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаОтпуск
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ПериодДействияНачало";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.BKM_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.BKM_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
	КонецЦикла;
	
	Движения.BKM_ОсновныеНачисления.Записать();

Конецпроцедуры

Процедура РасчитатьОклад()
	
	МинимальнаяДатаНачала = Дата("39991231");
	МаксимальнаяДатаОкончания = Дата("00010101");
	
	ЕстьОклад = Ложь;
	
	Для каждого Движение из Движения.BKM_ОсновныеНачисления Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОклад = Истина;
		
		Если МинимальнаяДатаНачала > Движение.ПериодДействияНачало Тогда
			МинимальнаяДатаНачала = Движение.ПериодДействияНачало;
		КонецЕсли;
		
		Если МаксимальнаяДатаОкончания < Движение.ПериодДействияКонец Тогда
			МаксимальнаяДатаОкончания = Движение.ПериодДействияКонец;
		КонецЕсли;
		
	КонецЦикла;
	
	Если не ЕстьОклад Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия / 8, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия / 8, 0) КАК План,
		|	BKM_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплатеОборот
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|	И ВидРасчета = &ВидРасчетаОклад) КАК BKM_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.BKM_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц,
		|			Сотрудник В
		|			(ВЫБРАТЬ
		|				BKM_НачисленияЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.BKM_НачисленияЗарплаты.ОсновныеНачисления КАК BKM_НачисленияЗарплатыОсновныеНачисления
		|			ГДЕ
		|				BKM_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка)) КАК BKM_ВыполненныеСотрудникомРаботыОбороты
		|		ПО BKM_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = BKM_ОсновныеНачисленияДанныеГрафика.Сотрудник
		|		И BKM_ВыполненныеСотрудникомРаботыОбороты.Период = BKM_ОсновныеНачисленияДанныеГрафика.ПериодДействия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МинимальнаяДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(МаксимальнаяДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеНачисления = Движения.BKM_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		ДвижениеНачисления.ОтработаноДней = ВыборкаДетальныеЗаписи.ОтработаноДней;
		ДвижениеНачисления.Результат = ДвижениеНачисления.Показатель * ВыборкаДетальныеЗаписи.ОтработаноДней /
						 ВыборкаДетальныеЗаписи.План + ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;
	КонецЦикла;
	
	Движения.BKM_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры	

Процедура РасчитатьОтпуск()

	ЕстьОтпуск = Ложь;
	
	Для каждого Движение из Движения.BKM_ОсновныеНачисления Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.BKM_ОсновныеНачисления.Отпуск Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОтпуск = Истина;
		
	КонецЦикла;
	
	Если не ЕстьОтпуск Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.ОтработаноДнейБаза КАК ОтработаноДнейБаза,
		|	BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия / 8, 0) КАК ДниОтпуска,
		|	BKM_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	BKM_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления КАК BKM_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_ОсновныеНачисления.БазаBKM_ОсновныеНачисления(&Измерения, &Измерения,,
		|			ВидРасчета = &ВидРасчетаОтпуск
		|		И Регистратор = &Ссылка) КАК BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления
		|		ПО BKM_ОсновныеНачисления.НомерСтроки = BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &ВидРасчетаОтпуск
		|		И Регистратор = &Ссылка) КАК BKM_ОсновныеНачисленияДанныеГрафика
		|		ПО BKM_ОсновныеНачисления.Сотрудник = BKM_ОсновныеНачисленияДанныеГрафика.Сотрудник
		|		И BKM_ОсновныеНачисления.ПериодДействия = BKM_ОсновныеНачисленияДанныеГрафика.ПериодДействия
		|ГДЕ
		|	BKM_ОсновныеНачисления.ВидРасчета = &ВидРасчетаОтпуск
		|	И BKM_ОсновныеНачисления.Регистратор = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.BKM_ОсновныеНачисления.Отпуск);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Измерения = Новый Массив;
		Измерения.Добавить("Сотрудник");
		Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.BKM_ОтпускаСотрудников.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДвижениеНачисления = Движения.BKM_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
	
		ДвижениеНачисления.ОтработаноДней = ВыборкаДетальныеЗаписи.ДниОтпуска;
		ДвижениеНачисления.Результат = (ВыборкаДетальныеЗаписи.РезультатБаза / ВыборкаДетальныеЗаписи.ОтработаноДнейБаза) * ВыборкаДетальныеЗаписи.ДниОтпуска;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДниОтпуска) Тогда
			ДвижениеОтпуска = Движения.BKM_ОтпускаСотрудников.Добавить();
			ДвижениеОтпуска.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			ДвижениеОтпуска.Период = Дата;
			ДвижениеОтпуска.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОтпуска.Год = Дата;
			ДвижениеОтпуска.Количество = ВыборкаДетальныеЗаписи.ДниОтпуска;
		КонецЕсли;
						
	КонецЦикла;
	
	Движения.BKM_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура СформироватьДвиженияУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	BKM_ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	КОНЕЦПЕРИОДА(BKM_ОсновныеНачисления.ПериодДействияКонец, МЕСЯЦ) КАК БазовыйПериодКонец,
		|	НАЧАЛОПЕРИОДА(BKM_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) КАК БазовыйПериодНачало
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления КАК BKM_ОсновныеНачисления
		|ГДЕ
		|	BKM_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	BKM_ОсновныеНачисления.Сотрудник,
		|	BKM_ОсновныеНачисления.ПериодРегистрации,
		|	КОНЕЦПЕРИОДА(BKM_ОсновныеНачисления.ПериодДействияКонец, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(BKM_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеУдержание = Движения.BKM_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУдержание, ВыборкаДетальныеЗаписи);
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.BKM_Удержания.НДФЛ;
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать();
	
КонецПроцедуры

Процедура РасчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_УдержанияБазаBKM_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
		|	BKM_УдержанияБазаBKM_ОсновныеНачисления.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.BKM_Удержания.БазаBKM_ОсновныеНачисления(&Измерения, &Измерения, &Регистратор, Регистратор = &Ссылка
		|	И ПериодРегистрации = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)) КАК BKM_УдержанияБазаBKM_ОсновныеНачисления";
		
	Запрос.УстановитьПараметр("Дата", Дата);
		
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Разрезы = Новый Массив;
    Разрезы.Добавить("Регистратор");
    Запрос.УстановитьПараметр("Регистратор", Разрезы);
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеУдрежания = Движения.BKM_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		ДвижениеУдрежания.Значение = ВыборкаДетальныеЗаписи.РезультатБаза * 0.13;
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать( ,Истина);
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(BKM_ОсновныеНачисления.Результат) КАК РезультатОсн,
		|	BKM_Удержания.Значение КАК РезультатУдержания
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления КАК BKM_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_Удержания КАК BKM_Удержания
		|		ПО BKM_ОсновныеНачисления.Сотрудник = BKM_Удержания.Сотрудник
		|		И BKM_ОсновныеНачисления.Регистратор = BKM_Удержания.Регистратор
		|ГДЕ
		|	BKM_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	BKM_ОсновныеНачисления.Сотрудник,
		|	BKM_Удержания.Значение";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.BKM_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.BKM_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.РезультатОсн - ВыборкаДетальныеЗаписи.РезультатУдержания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли